app/views/staffs/_form.html.erb

SELECT `departments`.* FROM `departments`
---
        <%= form.label :department_id, "Department", class: "form-label fw-bold" %>
        <%= form.collection_select :department_id, Department.all, :id, :name, { prompt: "Select a department" },{ class: "form-select" } %>