app/views/staffs/index.html.erb

            <h4 class="m-0 fw-semibold"><%= department.name %></h4>
            <small class="text-muted"><%= pluralize(department.staffs.count, "Staff") %></small>
---
SELECT `staffs`.* FROM `staffs`