app/views/guardians/show.html.erb

  <tbody>
    <% @guardian.student_guardians.each do |student_guardian|%>
---
SELECT `student_guardians`.* FROM `student_guardians` WHERE `student_guardians`.`guardian_id` = 3