lib/tasks/update_student_guardian_count.rake

    task update_student_guardian_count: :environment do
        students = Student.all
        students.each do |student|
            guardian_count = student.student_guardians.count
            student.update(number_of_guardians: guardian_count)
---
SELECT `students`.* FROM `students`
SELECT COUNT(*) FROM `student_guardians` WHERE `student_guardians`.`student_id` = 1
UPDATE `students` SET `students`.`updated_at` = '2025-10-09 07:19:59.284633', `students`.`number_of_guardians` = 1 WHERE `students`.`id` = 2