lib/tasks/update_employee_count.rake

    task update_employee_count: :environment do
        departments = Department.all
        departments.each do |department|
            emp_count = department.teachers.count
            student_count = department.students.count
            department.update(employee_count: emp_count, student_count: student_count)
---
SELECT `departments`.* FROM `departments`
SELECT COUNT(*) FROM `teachers` WHERE `teachers`.`department_id` = 1
SELECT COUNT(*) FROM `students` WHERE `students`.`department_id` = 1
UPDATE `departments` SET `departments`.`updated_at` = '2025-10-02 06:03:11.386647', `departments`.`employee_count` = 2, `departments`.`student_count` = 5 WHERE `departments`.`id` = 1