lib/tasks/update_guardian_student_count.rake

SELECT `guardians`.* FROM `guardians`
SELECT COUNT(*) FROM `student_guardians` WHERE `student_guardians`.`guardian_id` = 4
---
    task update_guardian_student_count: :environment do
        guardians = Guardian.all
        guardians.each do |guardian|
            guardian_count = guardian.student_guardians.count