app/views/students/_form.html.erb

        <%= form.label :department_id, "Department", class: "form-label fw-bold" %>
        <%= form.collection_select :department_id, Department.all, :id, :name, { prompt: "Select a department" },{ class: "form-select" } %>
---
SELECT `departments`.* FROM `departments`