app/views/students/show.html.erb

    <span class="badge bg-primary rounded-pill fs-6">
      <%= @student.classlists.count %>
---
SELECT `classlists`.* FROM `classlists` WHERE `classlists`.`student_id` = 1