app/views/departments/show.html.erb

SELECT `students`.* FROM `students` WHERE `students`.`department_id` = 1
---
  <tbody>
  <% @department.students.each do |student| %>

SELECT `teachers`.* FROM `teachers` WHERE `teachers`.`department_id` = 1
---
  <tbody>
    <% @department.teachers.each do |teacher| %>

SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`department_id` = 1
---
  <tbody>
    <% @department.staffs.each do |staff| %>