app/views/sections/_form.html.erb

      <%= form.label :subject_id, "Subject", class: "form-label fw-bold" %>
      <%= form.collection_select :subject_id, Subject.all, :id, :name, { prompt: "Select a subject" }, {class: "form-select", selected: @section.subject_id} %>
---
SELECT `subjects`.* FROM `subjects`