app/views/student_guardians/_form.html.erb

    <%= form.label :student_id, "Student", style: "display: block" %>
    <%= form.collection_select :student_id, Student.all, :id, :name, prompt: "Select a student" %>
---
SELECT `students`.* FROM `students`

    <%= form.label :guardian_id, "Guardian", style: "display: block" %>
    <%= form.collection_select :guardian_id, Guardian.all, :id, :name, selected: @student_guardian.guardian_id, prompt: "Select a guardian" %>
---
SELECT `guardians`.* FROM `guardians`