app/views/subjects/_form.html.erb

    <%= form.label :teacher_id, "Teacher", class: "form-label fw-bold" %>
    <%= form.collection_select :teacher_id, Teacher.all, :id, :name, {prompt: "Select a teacher"}, {class: "form-select"} %>
---
SELECT `teachers`.* FROM `teachers`