app/views/subjects/show.html.erb

SELECT `sections`.* FROM `sections` WHERE `sections`.`subject_id` = 1
---

<% @subject.sections.each do |section| %>

SELECT `classlists`.* FROM `classlists` WHERE `classlists`.`section_id` = 1
---
    <tbody>
      <% section.classlists.each do |classlist| %>