app/views/teachers/index.html.erb

SELECT `teachers`.* FROM `teachers`
---
            <h4 class="m-0 fw-semibold"><%= department.name %></h4>
            <small class="text-muted"><%= pluralize(department.teachers.count, "Teacher") %></small>