app/views/teachers/show.html.erb

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`teacher_id` = 2
SELECT `sections`.* FROM `sections` WHERE `sections`.`subject_id` = 1
---
    <tbody>
      <% @teacher.subjects.each do |subject| %>
        <% subject.sections.each do |section| %>