app/views/classlists/_form.html.erb

SELECT `students`.* FROM `students`
---
      <%= form.label :student_id, "Student", class: "form-label fw-bold" %>
      <%= form.collection_select :student_id, Student.all, :id, :name, {prompt: "Select a student"}, {class: "form-select"} %>

SELECT `sections`.* FROM `sections`
---
      <%= form.label :section_id, "Section", class: "form-label fw-bold" %>
      <%= form.collection_select :section_id, Section.all, :id, :name, {prompt: "Select a section"}, {class: "form-select", selected: @classlist.section_id} %>