app/controllers/classlists_controller.rb

SELECT `classlists`.* FROM `classlists`
---
  def index
    @classlists = Classlist.all

SELECT `sections`.* FROM `sections`
---
  def new
    @classlist = Classlist.new
    @classlist.section_id = params[:section_id] if params[:section_id].present?

INSERT INTO `classlists` (`student_id`, `section_id`, `created_at`, `updated_at`) VALUES (1, 1, '2025-09-02 06:46:58.269589', '2025-09-02 06:46:58.269589')
---
  def create
    @classlist = Classlist.new(classlist_params)

    respond_to do |format|
      if @classlist.save

DELETE FROM `classlists` WHERE `classlists`.`id` = 14
UPDATE `sections` SET `sections`.`number_of_students` = COALESCE(`sections`.`number_of_students`, 0) - 1 WHERE `sections`.`id` = 9
UPDATE `students` SET `students`.`number_of_units` = COALESCE(`students`.`number_of_units`, 0) - 2 WHERE `students`.`id` = 1
UPDATE `students` SET `students`.`updated_at` = '2025-09-17 11:07:16.638823', `students`.`total_assessment` = 35000 WHERE `students`.`id` = 1
---
  def destroy
    @classlist.destroy!

    @classlist.section.decrement!(:number_of_students)
    @classlist.student.decrement!(:number_of_units, @classlist.section.subject.number_of_units)

SELECT `classlists`.* FROM `classlists` WHERE `classlists`.`id` = 14 LIMIT 1
---
    def set_classlist
      @classlist = Classlist.find(params.expect(:id))