app/controllers/departments_controller.rb

SELECT `departments`.* FROM `departments`
---
  def index
    @departments = Department.all

SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1
---
  def show
    @department = Department.find(params[:id])

INSERT INTO `departments` (`name`, `location`, `created_at`, `updated_at`) VALUES ('PICE', 'ADNU', '2025-08-24 11:11:17.774856', '2025-08-24 11:11:17.774856')
---
  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save

UPDATE `departments` SET `departments`.`name` = 'CPE', `departments`.`updated_at` = '2025-08-28 06:40:06.509382' WHERE `departments`.`id` = 1
---
  def update
    respond_to do |format|
      if @department.update(department_params)

SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1
---
    def set_department
      @department = Department.find(params.expect(:id))