app/controllers/guardians_controller.rb

  def index
    @guardians = Guardian.all
---
SELECT `guardians`.* FROM `guardians`

  def create
    @guardian = Guardian.new(guardian_params)

    respond_to do |format|
      if @guardian.save
---
INSERT INTO `guardians` (`name`, `email_address`, `contact_number`, `number_of_students`, `created_at`, `updated_at`) VALUES ('John', 'Doe', '123', 1, '2025-10-09 06:10:32.229212', '2025-10-09 06:10:32.229212')

  def destroy
    @guardian.destroy!
---
DELETE FROM `guardians` WHERE `guardians`.`id` = 2

    def set_guardian
      @guardian = Guardian.find(params.expect(:id))
---
SELECT `guardians`.* FROM `guardians` WHERE `guardians`.`id` = 1 LIMIT 1