app/controllers/sections_controller.rb

  def index
    @sections = Section.all
---
SELECT `sections`.* FROM `sections`

  def new
    @section = Section.new
    @section.subject_id = params[:subject_id] if params[:subject_id].present?
---
SELECT `subjects`.* FROM `subjects`

  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save
---
INSERT INTO `sections` (`name`, `room`, `time_slot`, `subject_id`, `created_at`, `updated_at`, `number_of_students`) VALUES ('MATT101', 'D318', '1:00-5:00', 3, '2025-09-16 06:59:54.527313', '2025-09-16 06:59:54.527313', 0)

  def destroy
    @section.destroy!

    @section.subject.teacher.decrement!(:number_of_units, @section.subject.number_of_units)
---
DELETE FROM `sections` WHERE `sections`.`id` = 7
UPDATE `teachers` SET `teachers`.`updated_at` = '2025-09-17 10:17:29.377041', `teachers`.`monthly_salary` = 24000 WHERE `teachers`.`id` = 1

    def set_section
      @section = Section.find(params.expect(:id))
---
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 7 LIMIT 1