app/controllers/staffs_controller.rb

  def index
    @staffs = Staff.all
---
SELECT `staffs`.* FROM `staffs`

  def create
    @staff = Staff.new(staff_params)

    respond_to do |format|
      if @staff.save
---
INSERT INTO `staffs` (`name`, `email`, `monthly_salary`, `status`, `department_id`, `created_at`, `updated_at`) VALUES ('long hair', '@habaNgHair', 100600.0, 'active', 1, '2025-10-02 06:21:20.741321', '2025-10-02 06:21:20.741321')

  def destroy
    @staff.destroy!

    @staff.department.decrement!(:employee_count)
---
DELETE FROM `staffs` WHERE `staffs`.`id` = 1
UPDATE `departments` SET `departments`.`employee_count` = COALESCE(`departments`.`employee_count`, 0) - 1 WHERE `departments`.`id` = 1

    def set_staff
      @staff = Staff.find(params.expect(:id))
---
SELECT `staffs`.* FROM `staffs` WHERE `staffs`.`id` = 1 LIMIT 1