app/controllers/student_guardians_controller.rb

  def index
    @student_guardians = StudentGuardian.all
---
SELECT `student_guardians`.* FROM `student_guardians`

  def create
    @student_guardian = StudentGuardian.new(student_guardian_params)

    respond_to do |format|
      if @student_guardian.save
---
INSERT INTO `student_guardians` (`relationship`, `student_id`, `guardian_id`, `created_at`, `updated_at`) VALUES ('Father', 1, 3, '2025-10-09 06:26:34.529760', '2025-10-09 06:26:34.529760')

  def update
    respond_to do |format|
      if @student_guardian.update(student_guardian_params)
---
UPDATE `guardians` SET `guardians`.`number_of_students` = 1, `guardians`.`updated_at` = '2025-10-09 07:54:03.911293' WHERE `guardians`.`id` = 6
UPDATE `students` SET `students`.`updated_at` = '2025-10-09 07:54:03.923021', `students`.`number_of_guardians` = 2 WHERE `students`.`id` = 1

  def destroy
    @student_guardian.destroy!
    @student_guardian.guardian.decrement!(:number_of_students)
    @student_guardian.student.decrement!(:number_of_guardians)
---
DELETE FROM `student_guardians` WHERE `student_guardians`.`id` = 1
UPDATE `students` SET `students`.`number_of_guardians` = COALESCE(`students`.`number_of_guardians`, 0) - 1 WHERE `students`.`id` = 1
UPDATE `guardians` SET `guardians`.`number_of_students` = COALESCE(`guardians`.`number_of_students`, 0) - 1 WHERE `guardians`.`id` = 3
UPDATE `guardians` SET `guardians`.`number_of_students` = COALESCE(`guardians`.`number_of_students`, 0) - 1 WHERE `guardians`.`id` = 4

    def set_student_guardian
      @student_guardian = StudentGuardian.find(params.expect(:id))
---
SELECT `guardians`.* FROM `guardians` WHERE `guardians`.`id` = 4 LIMIT 1
SELECT `student_guardians`.* FROM `student_guardians` WHERE `student_guardians`.`id` = 4 LIMIT 1