app/controllers/student_guardians_controller.rb

  def new
    @student_guardian = StudentGuardian.new
    @student_guardian.guardian_id = params[:guardian_id] if params[:guardian_id].present?
---
SELECT `guardians`.* FROM `guardians`

  def create
    @student_guardian = StudentGuardian.new(student_guardian_params)

    respond_to do |format|
      if @student_guardian.save
        # If update
        @student_guardian.guardian.update(number_of_students: @student_guardian.guardian.student_guardians.count)
---
SELECT COUNT(*) FROM `student_guardians` WHERE `student_guardians`.`student_id` = 1