app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT `students`.* FROM `students`

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`name`, `year_level`, `program`, `department_id`, `created_at`, `updated_at`, `number_of_units`, `total_assessment`, `number_of_guardians`) VALUES ('Ivan', 3, 'CpE', 1, '2025-10-16 11:47:59.602222', '2025-10-16 11:47:59.602222', 0, 0, 0)

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE `students` SET `students`.`name` = 'Rick', `students`.`year_level` = 3, `students`.`program` = 'CPE', `students`.`updated_at` = '2025-09-02 07:43:58.431516' WHERE `students`.`id` = 4

  def destroy
    @student.destroy!

    @student.department.decrement!(:student_count)
---
DELETE FROM `students` WHERE `students`.`id` = 6
UPDATE `departments` SET `departments`.`student_count` = COALESCE(`departments`.`student_count`, 0) - 1 WHERE `departments`.`id` = 1

    def set_student
      @student = Student.find(params.expect(:id))
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 6 LIMIT 1