app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects`
---
  def index
    @subjects = Subject.all

INSERT INTO `subjects` (`name`, `teacher_id`, `created_at`, `updated_at`, `number_of_units`) VALUES ('Rails', 1, '2025-09-16 06:59:23.352580', '2025-09-16 06:59:23.352580', 4)
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

UPDATE `subjects` SET `subjects`.`updated_at` = '2025-09-16 06:38:30.108408', `subjects`.`number_of_units` = 3 WHERE `subjects`.`id` = 1
---
  def update
    respond_to do |format|
      if @subject.update(subject_params)

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
    def set_subject
      @subject = Subject.find(params.expect(:id))