app/controllers/teachers_controller.rb

SELECT `teachers`.* FROM `teachers`
---
  def index
    @teachers = Teacher.all

INSERT INTO `teachers` (`name`, `email`, `specialization`, `status`, `department_id`, `created_at`, `updated_at`, `number_of_units`, `monthly_salary`) VALUES ('renz', 'ahahah', 'chill', 'active', 1, '2025-10-02 06:23:17.234732', '2025-10-02 06:23:17.234732', 0, 0)
---
  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save

UPDATE `teachers` SET `teachers`.`name` = 'Amer', `teachers`.`updated_at` = '2025-09-02 07:45:04.195460' WHERE `teachers`.`id` = 2
---
  def update
    respond_to do |format|
      if @teacher.update(teacher_params)

DELETE FROM `teachers` WHERE `teachers`.`id` = 3
UPDATE `departments` SET `departments`.`employee_count` = COALESCE(`departments`.`employee_count`, 0) - 1 WHERE `departments`.`id` = 1
---
  def destroy
    @teacher.destroy!

    @teacher.department.decrement!(:employee_count)

SELECT `teachers`.* FROM `teachers` WHERE `teachers`.`id` = 3 LIMIT 1
---
    def set_teacher
      @teacher = Teacher.find(params.expect(:id))